%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%{
x-correlation解析のサンプルコードを書いただけの関数
作るときに見本にするために作っただけ
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clear;
%% set param
t = 0:1/1000:1;
%↓使用する2つの関数
x = sin(2*pi*t);
y = sin(2*pi*t);

%% code section
[c,lags] = xcorr(x-mean(x),y-mean(y),'coef'); %正規化とx軸の設定(lagsでx軸を管理し、xcorr()の中で正規化を行っている
stem(lags,c) %離散信号のプロット、確認用だから本番では使用しないと思われる
%使用するデータはc(length(c)+1)の値であることに注意